export const fixedMainStats = [
  'HP%',
  '공격력%',
  '방어력%',
  '크리티컬',
  '크리티컬피해',
  '치료 보너스',
  '공명 효율',
  '응결 보너스',
  '용융 보너스',
  '전도 보너스',
  '기류 보너스',
  '회절 보너스',
  '인멸 보너스'
];

export const statMainValues = {
  'HP%': ['33.0%', '30.0%', '22.8%'],
  '공격력%': ['33.0%', '30.0%', '18.0%'],
  '방어력%': ['41.5%', '38.0%', '18.0%'],
  크리티컬: ['22.0%'],
  크리티컬피해: ['44.0%'],
  '치료 보너스': ['26.4%'],
  '공명 효율': ['32.0%'],
  '응결 보너스': ['30.0%'],
  '용융 보너스': ['30.0%'],
  '전도 보너스': ['30.0%'],
  '기류 보너스': ['30.0%'],
  '회절 보너스': ['30.0%'],
  '인멸 보너스': ['30.0%']
};

const secondLineFixedStats = ['공격력', 'HP'];

const secondLineValues = {
  공격력: ['150', '100'],
  HP: ['2280']
};

export const fixedSubStats = [
  'HP',
  'HP%',
  '공격력',
  '공격력%',
  '방어력',
  '방어력%',
  '크리티컬',
  '크리티컬피해',
  '일반공격피해보너스',
  '강공격피해보너스',
  '공명스킬피해보너스',
  '공명해방피해보너스',
  '공명효율'
];

export const statSubValues = {
  HP: [320, 360, 390, 430, 470, 510, 540, 580],
  공격력: [30, 40, 50, 60],
  방어력: [40, 50, 60],
  'HP%': ['6.4%', '7.1%', '7.9%', '8.6%', '9.4%', '10.1%', '10.9%', '11.6%'],
  '공격력%': ['6.4%', '7.1%', '7.9%', '8.6%', '9.4%', '10.1%', '10.9%', '11.6%'],
  '방어력%': ['8.1%', '9.0%', '10.0%', '10.9%', '11.8%', '12.8%', '13.8%', '14.7%'],
  크리티컬: ['6.3%', '6.9%', '7.5%', '8.1%', '8.7%', '9.3%', '9.9%', '10.5%'],
  크리티컬피해: ['12.6%', '13.8%', '15%', '16.2%', '17.4%', '18.6%', '19.8%', '21%'],
  일반공격피해보너스: ['6.4%', '7.1%', '7.9%', '8.6%', '9.4%', '10.1%', '10.9%', '11.6%'],
  강공격피해보너스: ['6.4%', '7.1%', '7.9%', '8.6%', '9.4%', '10.1%', '10.9%', '11.6%'],
  공명스킬피해보너스: ['6.4%', '7.1%', '7.9%', '8.6%', '9.4%', '10.1%', '10.9%', '11.6%'],
  공명해방피해보너스: ['6.4%', '7.1%', '7.9%', '8.6%', '9.4%', '10.1%', '10.9%', '11.6%'],
  공명효율: ['6.8%', '7.6%', '8.4%', '9.2%', '10%', '10.8%', '11.6%', '12.4%']
};

export const percentStatMap = [
  { name: 'HP%', keyword: 'HP' },
  { name: '공격력%', keyword: '공격' },
  { name: '방어력%', keyword: '방어' },
  { name: '크리티컬', keyword: '크리' },
  { name: '크리티컬피해', keyword: '크리' },
  { name: '치료 보너스', keyword: '치료' },
  { name: '공명 효율', keyword: '공명' },
  { name: '응결 보너스', keyword: '응결' },
  { name: '용융 보너스', keyword: '용융' },
  { name: '전도 보너스', keyword: '전도' },
  { name: '기류 보너스', keyword: '기류' },
  { name: '회절 보너스', keyword: '회절' },
  { name: '인멸 보너스', keyword: '인멸' }
];
